Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииБитрикса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омИзделиеКомплектНаКлиентеСервере/Ext/Module.bsl
Процедура СформироватьПолноеНаименование(ОбъектИзделиеКомплект) Экспорт
	ОсновноеИзделие = Неопределено;
	
	Для каждого строкаИзделие Из ОбъектИзделиеКомплект.ИзделияЭлемент Цикл
		Если строкаИзделие.Основное Тогда
			ОсновноеИзделие = строкаИзделие.ИзделиеЭлемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(ОсновноеИзделие) ИЛИ ЗначениеЗаполнено(ОбъектИзделиеКомплект.Проект) Тогда
		стДанныеДляКода = омИзделиеКомплект.ПолучитьДанныеДляКода(ОсновноеИзделие, ОбъектИзделиеКомплект.Проект);	
		
	    ОбъектИзделиеКомплект.Наименование = Формат(стДанныеДляКода.НомерПроекта,"ЧЦ=2; ЧВН=") + "." 
			+ стДанныеДляКода.НомерПомещения + "." + Формат(стДанныеДляКода.НомерИзделия,"ЧЦ=3; ЧВН=") 
			+ "." + омСтроки.ПолучитьРазрешенноеИмяРеквизитаПоСтроке(ОбъектИзделиеКомплект.НаименованиеКомплекта);
			
		ОбъектИзделиеКомплект.ОсновноеПомещение = ?(ЗначениеЗаполнено(ОсновноеИзделие)
													,омИзделиеЭлемент.ПолучитьПомещениеИзделия(ОсновноеИзделие)
													,ПредопределенноеЗначение("Справочник.Помещения.ПустаяСсылка"));
	Иначе
	   	ОбъектИзделиеКомплект.Наименование 		= ОбъектИзделиеКомплект.НаименованиеКомплекта;
		ОбъектИзделиеКомплект.ОсновноеПомещение = ПредопределенноеЗначение("Справочник.Помещения.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры // СформировитьПолноеНаименование()
